<html>
<head>
	<title>Pandocréon Carta Genius : Aide mémoire</title>
	<style>
		a.r { color: #800000 }
		a.g { color: #008000 }
		a.b { color: #000080 }
	</style>
</head>
<body bgcolor="#ffffff">
	<center>
	  <h2>Pandocr&eacute;on Carta Genius</h2>
	  <h3>Aide-m&eacute;moire</h3>
	</center>

<br />

<a name="scalar"></a>
<b>scalaire</b> [&eacute;valuateur d'expressions]
<blockquote>
Nombre flottant. La virgule s'&eacute;crit avec un point.<br />
Exemples : 12, 13.45, 148134.352352
</blockquote>
<br />

<a name="value"></a>
<b>valeur</b> [&eacute;valuateur d'expressions]
<blockquote>
Distance constitu&eacute;e d'une valeur suivie d'une unit&eacute;. L'unit&eacute; peut &ecirc;tre "mm" (millim&egrave;tres), "cm" (centim&egrave;tres), "in" (pouces) ou "pt" (points).<br />
Exemples : 210mm, 55pt, 121.1323in
</blockquote>
<br />

<a name="element"></a>
<b>&eacute;l&eacute;ment</b> [&eacute;valuateur d'expressions]
<blockquote>
Objet consitu&eacute; de deux valeurs, l'une pour sa largeur, l'autre pour sa hauteur. Lorsqu'un &eacute;l&eacute;ment doit &ecirc;tre repr&eacute;sent&eacute; sous forme litt&eacute;rale, cela donne deux scalaires s&eacute;par&eacute;s par le caract&egrave;re 'x', suivi d'une unit&eacute;.<br />
Exemples : 21x29.7cm, 11x14pt
</blockquote>
<br />

<a name="color"></a>
<b>couleur</b> [&eacute;valuateur d'expressions]
<blockquote>
Les couleurs sont encod&eacute;es de la m&ecirc;me manir&egrave;re que dans les pages HTML : le caract&egrave;re '#' suivi de six caract&egrave;res hexad&eacute;cimaux (les deux premiers pour la couleur rouge, les deux suivants pour le vert, les deux derniers pour le bleu).<br />
Exemples : #000000 (noir), #ffffff (blanc), #ff0000 (rouge vif), #008000 (vert fonc&eacute;)
</blockquote>
<br />

<a name="string"></a>
<b>cha&icirc;ne</b> [&eacute;valuateur d'expressions]
<blockquote>
Les cha&icirc;nes de caract&egrave;res sont simplement encadr&eacute;es par des guillemets.<br />
Exemples : "blabla", "ceci est une cha&icirc;ne"
</blockquote>
<br />

<a name="boolean"></a>
<b>bool&eacute;en</b> [&eacute;valuateur d'expressions]
<blockquote>
Les bool&eacute;ens sont des valeurs vraies ou fausses uniquement.<br />
Exemples : $TRUE, $FALSE
</blockquote>
<br />

<a name="bool"></a>
<b>bool&eacute;en</b> [param&egrave;tres]
<blockquote>
Certains param&egrave;tres acceptent une valeur bool&eacute;enne, qui peut &ecirc;tre YES (param&egrave;tre valid&eacute) ou NO (param&egrave;tre invalid&eacute). La recherche n'est pas sensible &agrave; la casse, les valeurs peuvent donc s'&eacute;crire YES, yes, Yes, ...<br />
</blockquote>
<br />

<hr />
<a name="blendmode"></a>
<center><b>blendmode</b></center><br />

<a name="multiply"></a>
<b>Multiply</b>
<blockquote>
Multiplies les valeurs de la couleur de fond et de la couleur source. La couleur r&eacute;sultant est toujours au moins aussi fonc&eacute;e que l'une ou l'autre des deux couleurs initiales. Multiplier une couleur avec du noir produit du noir. Multiplier une couleur avec du blanc laisse la couleur inchang&eacute;e. Dessiner plusieurs objets se recouvrant successivement avec une couleur autre que noir ou blanc produit des couleurs de plus en plus sombres.
</blockquote>
<br />

<a name="screen"></a>
<b>Screen</b>
<blockquote>
Multiplie les couleurs compl&eacute;mentaires de la couleur de fond et de la couleur source. La couleur r&eacute;sultant est toujours au moins aussi claire que l'une ou l'autre des deux couleurs initiales. 'Screener' avec du noir laisse la couleur inchang&eacute;e. 'Screener' avec du blanc produit du blanc. L'effet est similaire à la projection simultan&eacute;e de plusieurs transparents sur un même &eacute;cran.
</blockquote>
<br />

<a name="overlay"></a>
<b>Overlay</b>
<blockquote>
Multiplie ou 'screene' les couleurs, en fonction de la couleur de fond. La couleur source recouvre la couleur de fond tout en pr&eacute;servant les reflets et les ombres de la couleur de fond. La couleur de fond n'est pas remplac&eacute;e mais elle est mix&eacute;e avec la couleur source en refl&eacute;tant ses reflets et ses ombres.
</blockquote>
<br />

<a name="softlight"></a>
<b>SoftLight</b>
<blockquote>
Assombrit ou &eacute;claircit les couleurs, en fonction de la couleur source. L'effet est similaire à l'application d'un spot lumineux diffus sur la couleur de fond. Si la couleur source est plus claire que sombre, la couleur de fond est &eacute;claircie, comme si elles &eacute;taient combin&eacute;es. Si la couleur source est plus sombre que claire, la couleur de fond est rendue plus sombre, comme si elles &eacute;taient 'cuites'. Effectu&eacute; avec du noir ou du blanc produit des zones distinctement sombres ou claires, mais ne donne pas du noir ou du blanc pur.
</blockquote>
<br />

<a name="hardlight"></a>
<b>HardLight</b>
<blockquote>
Multiplie ou 'screen' les couleurs, en fonction de la couleur source. L'effet est similaire à l'application d'un spot lumineux franc sur la couleur de fond. Si la couleur source est plus claire que sombre, la couleur de fond est &eacute;claircie, comme si elles &eacute;taient 'screen&eacute;es'. C'est pratique pour ajouter des reflets à une image. Si la couleur source est plus sombre que claire, la couleur de fond est assombrie, comme si elles &eacute;taient multipli&eacute;es. C'est pratique pour ajouter des ombres à une image. Effectu&eacute; avec du noir ou du blanc pur produit du noir ou du blanc pur.
</blockquote>
<br />

<a name="colordodge"></a>
<b>ColorDodge</b>
<blockquote>
Eclaircie la couleur de fond pour refl&eacute;ter la couleur source. Effectu&eacute; avec du noir ne produit aucun changement.
</blockquote>
<br />

<a name="colorburn"></a>
<b>ColorBurn</b>
<blockquote>
Assombrie la couleur de fond pour refl&eacute;ter la couleur source. Effectu&eacute; avec du blanc ne produit aucun changement.
</blockquote>
<br />

<a name="darken"></a>
<b>Darken</b>
<blockquote>
S&eacute;lectionne le plus sombre de la couleur de fond et de la couleur source. La couleur de fond est remplac&eacute;e par la couleur source là où la couleur source est plus sombre, autrement l'image reste inchang&eacute;e.
</blockquote>
<br />

<a name="lighten"></a>
<b>Lighten</b>
<blockquote>
S&eacute;lectionne le plus clair de la couleur de fond et de la couleur source. La couleur de fond est remplac&eacute;e par la couleur source là où la couleur source est plus claire, autrement l'image reste inchang&eacute;e.
</blockquote>
<br />

<a name="difference"></a>
<b>Difference</b>
<blockquote>
Soustrait la couleur source de la couleur de fond, ou la couleur de fond de la couleur source, en fonction de laquelle est la plus claire. Effectu&eacute; avec du blanc inverse la couleur de fond, avec du noir cela ne produit aucun changement.
</blockquote>
<br />

<a name="exclusion"></a>
<b>Exclusion</b>
<blockquote>
Produit un effet similaire, mais avec moins de contraste, que le mode 'Difference'. Effectu&eacute; avec du blanc inverse la couleur de fond, du noir ne produit aucun changement.
</blockquote>
<br />

<a name="hue"></a>
<b>Hue</b>
<blockquote>
Cr&eacute;e une couleur avec la luminosit&eacute; et la saturation de la couleur de fond, et la teinte de la couleur source.
</blockquote>
<br />

<a name="saturation"></a>
<b>Saturation</b>
<blockquote>
Cr&eacute;e une couleur avec la luminosit&eacute; et la teinte de la couleur de fond, et la saturation de la couleur source. Effectu&eacute; sur du gris pur (pas de saturation) ne produit aucun changement.Cr&eacute;e une couleur avec la luminosit&eacute; et la teinte de la couleur de fond, et la saturation de la couleur source. Effectu&eacute; sur du gris pur (pas de saturation) ne produit aucun changement.
</blockquote>
<br />

<a name="blend-color"></a>
<b>Color</b>
<blockquote>
Cr&eacute;e une couleur avec la luminosit&eacute; de la couleur de fond, et la teinte et la saturation de la couleur source. Cela pr&eacute;serve les niveaux de gris de la couleur de fond et est pratique pour coloriser les images monochromes et pour teinter les images couleurs.
</blockquote>
<br />

<a name="luminosity"></a>
<b>Luminosity</b>
<blockquote>
Cr&eacute;e une couleur avec la teinte et la saturation de la couleur de fond, et la luminosit&eacute; de la couleur source. Cela produit un effet inverse du mode 'Color'.
</blockquote>
<br />

<hr />
<a name="pdf"></a>
<b>Version PDF</b>
<blockquote>
La version du format PDF support&eacute; peut &ecirc;tre 1.3, 1.4 ou 1.5. N'oubliez pas que la version 1.3 ne support pas la transparence. Les sp&eacute;cificit&eacute;s de la version 1.5 ne sont pas exploit&eacute;es.
</blockquote>
<br />

<a name="unit"></a>
<b>Unit&eacute; de base</b>
<blockquote>
Les unit&eacute;s g&eacute;r&eacute;es par Carta Genius sont les millim&egrave;tres (mm), les centim&egrave;tres (cm), les pouces (in) et les points (pt). La d&eacute;finition d'un point est d'&ecirc;tre un soixante-douzi&egrave;me de pouce.
</blockquote>
<br />

<a name="unit"></a>
<b>C&ocirc;t&eacute; de retournement</b>
<blockquote>
Le c&ocirc;t&eacute; de retournement d&eacute;fini la mani&egrave;re dont le verso des pages est imprim&eacute;, afin de faire co&iuml;ncider les recto et le verso des cartes. Ce param&egrave;tre peut valoir NONE (pas de verso), WIDTH (retournement suivant l'axe horizontal) ou HEIGHT (retournement suivant l'axe vertical).
</blockquote>
<br />

<hr />
<a name="align"></a>
<a name="left"></a>
<a name="right"></a>
<a name="center"></a>
<a name="justify"></a>
<b>Alignement du texte</b>
<blockquote>
<ul>
  <li>left : texte align&eacute; &agrave; gauche (d&eacute;faut)</li>
  <li>right : texte align&eacute; &agrave; droite</li>
  <li>center : texte centr&eacute;</li>
  <li>justify : texte justifi&eacute;</li>
</ul>
</blockquote>
<br />

<hr />
<a name="font-courier"></a>
<a name="font-helvetica"></a>
<a name="font-times"></a>
<a name="font-symbol"></a>
<a name="font-zapf"></a>
<b>Fontes int&eacute;gr&eacute;es</b>
<blockquote>
<ul>
  <li>Courier : fonte dont tous les caract&egrave;res ont la m&ecirc;me largeur, style machine &agrave; &eacute;crire, &eacute;quivalente au "courier-new"</li>
  <li>Courier-Bold : la m&ecirc;me en gras</li>
  <li>Courier-Oblique : la m&ecirc;me en italique</li>
  <li>Courier-BoldOblique : la m&ecirc;me en gras et en italique</li>
  <li>Helvetica : fonte sans empattement, plut&ocirc;t faite pour les titres, &eacute;quivalente au "arial"</li>
  <li>Helvetica-Bold : la m&ecirc;me en gras</li>
  <li>Helvetica-Oblique : la m&ecirc;me en italique</li>
  <li>Helvetica-BoldOblique : la m&ecirc;me en gras et en italique</li>
  <li>Times-Roman : fonte avec empattement, &eacute;quivalente au "time-new-roman"</li>
  <li>Times-Bold : la m&ecirc;me en gras</li>
  <li>Times-Italic : la m&ecirc;me en italique</li>
  <li>Times-BoldItalic : la m&ecirc;me en gras et en italique</li>
  <li>Symbol : une fonte de caract&egrave;res sp&eacute;ciaux, utilisables dans des formules math&eacute;matiques, par exemple</li>
  <li>ZapfDingbats : fonte contenant des symboles</li>
</ul>
</blockquote>

<br /><hr />
<font size="-2">Copyright (c) 2004-2005, Amaury Bouchard<br />
Cette documentation est plac&eacute;e sous les termes de la <a href="http://www.gnu.org/licenses/fdl.html">GNU Free Documentation License</a></font>

</body>
</html>
